homeManagerModules/emacs/config/config.org
#+TITLE: EMACS CONFIG
#+AUTHOR: Noah Joyner
#+DESCRIPTION: Personal Emacs Config
#+AUTO_TANGLE: t
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el 

* Contents                                                              :toc:
- [[#core][Core]]
  - [[#package-management][Package Management]]
  - [[#evil][eVil]]
  - [[#keybinds][Keybinds]]
  - [[#ivycounsel][Ivy/Counsel]]
  - [[#helpful][Helpful]]
  - [[#company][Company]]
  - [[#recovery-clutter][Recovery Clutter]]
  - [[#hydra][Hydra]]
  - [[#recentf][Recentf]]
  - [[#sudo-edit][Sudo Edit]]
- [[#rice][Rice]]
  - [[#all-the-icons][All The Icons]]
  - [[#dashboard][Dashboard]]
  - [[#doom-modeline][Doom Modeline]]
  - [[#doom-themes][Doom Themes]]
  - [[#font-config][Font Config]]
  - [[#tweaks][Tweaks]]
- [[#development][Development]]
  - [[#ai-integration][Ai Integration]]
  - [[#languages][Languages]]
  - [[#project-management][Project Management]]
  - [[#snippets][Snippets]]
  - [[#treemacs][Treemacs]]
  - [[#tweaks-1][Tweaks]]
  - [[#vterm][Vterm]]
- [[#org][Org]]
  - [[#org-ql][Org-Ql]]
  - [[#auto-tangle][Auto Tangle]]
  - [[#enabling-bullets][Enabling Bullets]]
  - [[#enabling-toc][Enabling ToC]]
  - [[#org-roam---disabled][Org Roam - Disabled]]
- [[#misc-modes][Misc Modes]]
  - [[#pdf-support][PDF Support]]

* Core

** Package Management
Set up straight.el as package manager using bootstrap code from [[https://github.com/radian-software/straight.el][their github.]]
Set use-package to use straight be default as well to keep use-package usage consistent.
#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
      	"straight/repos/straight.el/bootstrap.el"
    	(or (bound-and-true-p straight-base-dir)
  	    user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
  	(url-retrieve-synchronously
  	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
  	 'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Set up use-package to use straight.el
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
#+end_src

*** Early Init
Set early init vars for straight.el
#+begin_src emacs-lisp :tangle ./early-init.el
(setq package-enable-at-startup nil)
#+end_src

** eVil
Vi emulation layer. Adds vim emulation to emacs in all programming and text editing buffers. Evil collection is a collection of keybind packages designed to integrate vim keybinds into popular emacs packages such as magit.
#+begin_src emacs-lisp
    (use-package evil
      :hook ((prog-mode text-mode) . display-line-numbers-mode)
      :init
      (setq evil-want-integration t
          evil-want-keybinding nil
          evil-want-C-i-jump nil
          evil-respect-visual-line-mode t
          evil-want-Y-yank-to-eol t)
      (evil-mode))

    ;; Keybind collection for evil
    (use-package evil-collection
      :after evil
      :config
      (evil-collection-init))
#+end_src


** Keybinds

*** General
Keybind defenitions using general.el
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-evil-setup)

    (general-define-key
     "C-=" 'text-scale-increase
     "C--" 'text-scale-decrease)

    ;; leader key definer
    (general-create-definer nj/leader-keys
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "C-SPC") ;; non evil buffers

    ;; nav and command keybinds
    (nj/leader-keys
      "x" '(counsel-M-x :wk "command")
      "/" '(find-file :wk "goto file")
      ">" '(:ignore t :wk "goto")
      "> r" '(counsel-recentf :wk "goto recent file")
      "> m" '(counsel-bookmark :wk "goto bookmark")
      "> c" '((lambda () (interactive) (find-file "~/.config/emacs/config.org")) :wk "goto emacs config")
      "C-/" '(comment-line :wk "comment lines"))

    (nj/leader-keys
      "TAB" '(evil-window-next :wk "next window"))

    ;; buffer keybinds
    (nj/leader-keys
      "b" '(:ignore t :wk "buffer")
      "b b" '(counsel-switch-buffer :wk "switch to buffer")
      "b i" '(ibuffer :wk "ibuffer")
      "b k" '(kill-this-buffer :wk "kill buffer")
      "b n" '(next-buffer :wk "next buffer")
      "b p" '(previous-buffer :wk "previous buffer")
      "b r" '(revert-buffer :wk "reload buffer"))

    ;; bookmarks
    (nj/leader-keys
      "m" '(:ignore t :wk "bookmarks")
      "m d" '(bookmark-delete :wk "delete bookmark")
      "m l" '(bookmark-bmenu-list :wk "bookmark list")
      "m m" '(bookmark-set :wk "add bookmark")
      "m M" '(bookmark-set-no-overwrite :wk "add permanent bookmark")))
#+end_src


*** Which-Key
Display tooltips on slow keybind inputs
#+begin_src emacs-lisp
    (use-package which-key
      :diminish
      :init
      (which-key-mode 1)
      :custom
      (which-key-idle-delay 0.8)
      (which-key-allow-imprecise-window-fit nil))
#+end_src


** Ivy/Counsel
Rich completion frontend with all-the-icons support. Uses counsel as well.
#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-search-i-kill))
    :config
    (ivy-mode 1))

  (use-package counsel
    :diminish
    :after ivy
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history)))

  (use-package all-the-icons-ivy-rich
    :ensure t
    :init (all-the-icons-ivy-rich-mode 1))

  (use-package ivy-rich
    :after ivy
    :after all-the-icons-ivy-rich
    :after counsel
    :ensure t
    :init (ivy-rich-mode 1)) ;; this gets us descriptions in M-x.
#+end_src


** Helpful
This package extends the default help functionality in emacs to be more intuitive and presentable.
#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #' helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key)
    :config
    (nj/leader-keys
      "h" '(:ignore t :wk "help")
      "h f" '(describe-function :wk "describe function")
      "h v" '(describe-variable :wk "describe variable")))
#+end_src


** Company
Auto-completion backend, used in tandem with many development packages
#+begin_src emacs-lisp
  (use-package company
    :defer 2
    :diminish
    :custom
    (company-begin-commands '(self-insert-command))
    (company-idle-delay .1)
    (company-minimum-prefix-length 2)
    (company-show-numbers t)
    (company-tooltip-align-annotations 't)
    (global-company-mode t))

  (use-package company-box
    :after company
    :diminish
    :hook (company-mode . company-box-mode))
#+end_src


** Recovery Clutter
Set default Emacs backup directory - temp directory
Otherwise by defualt emacs will save backup files to the directory the original file is located in, which creates a mess for git.
#+begin_src emacs-lisp
  (setq backup-directory-alist
        `((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms
        `((".*" ,temporary-file-directory t)))
#+end_src


** TODO Hydra
Allows for fast minibuffer based one time keybinds
#+begin_src emacs-lisp
  (use-package hydra)
#+end_src


** Recentf
Recent file list - add exclusions here
#+begin_src emacs-lisp
  (use-package recentf
    :config
    (recentf-mode)
    (add-to-list 'recentf-exclude
  	       "~/.config/emacs/.cache/*"))
#+end_src


** Sudo Edit
Edit buffers using sudo privileges
#+begin_src emacs-lisp
  (use-package sudo-edit
    :config
    (nj/leader-keys
      "s" '(:ignore t :wk "sudo")
      "s /" '(sudo-edit-find-file :wk "sudo find file")
      "s ." '(sudo-edit :wk "sudo edit current file")))
#+end_src


* Rice

** All The Icons
Icon Support - utilized heavily by other packages
#+begin_src emacs-lisp
  (use-package all-the-icons
    :ensure t
    :if (display-graphic-p))
  (use-package all-the-icons-dired ;; ATI Dired Support
    :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src



** Dashboard
Launch page, syncs with recentf, bookmarks, and projectile
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :init
    (setq initial-buffer-choice 'dashboard-open)
    :custom
    (dashboard-set-heading-icons t)
    (dashboard-set-file-icons t)
    (dashboard-center-content t) 
    (dashboard-projects-backend 'projectile)
    (dashboard-items '((recents . 8)
                            (agenda . 6)
                            (bookmarks . 6)
                            (projects . 8)))
    (dashboard-modify-heading-icons '((recents . "file-text")
                                      (bookmarks . "book")))
    :config
    (dashboard-setup-startup-hook))
#+end_src


** Doom Modeline
Better looking modeline from doom emacs
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)) 
  (use-package diminish) ;; Adds ability to diminish modes from modeline
#+end_src



