homeManagerModules/emacs/config/config.org
** Doom Themes
Theme management

Create custom themes here:
https://mswift42.github.io/themecreator/

#+begin_src emacs-lisp
  (add-to-list 'custom-theme-load-path "~/.config/emacs/themes/")
  (use-package doom-themes
    :custom
    (doom-themes-enable-bold t)
    (doom-themes-enable-italic t)
    :config
    (load-theme 'doom-horizon t))
#+end_src



** Font Config
General UI Font Config

#+begin_src emacs-lisp
  ;;create font default
  (set-face-attribute 'default nil
    :font "FiraCodeNerdFont"
    :weight 'regular)

  ;;make comments italicized
  (set-face-attribute 'font-lock-comment-face nil
    :slant 'italic)

  ;;make keywords italicized
  (set-face-attribute 'font-lock-keyword-face nil
    :slant 'italic)

  ;;add font to default
  (add-to-list 'default-frame-alist '(font . "FiraCode-12"))

  (set-face-attribute 'variable-pitch nil
                      :font "FiraSans"
                      :height 325
                      :weight 'regular)

  ;;set line spacing
  (setq-default line-spacing 0.20)
#+end_src



** Tweaks
Various GUI tweaks and settings
#+begin_src emacs-lisp
  ;; disable gui bars
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (set-fringe-mode 10)

  ;; disable startup screen
  (setq inhibit-startup-screen t)  

  ;; relative line numbering
  (setq display-line-numbers-type 'relative)

  ;; visual line mode
  (visual-line-mode t)

  ;; zoom on scroll
  (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
  (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)

  ;; scroll margin
  (setq scroll-margin 6)
  (setq scroll-conservatively 100)
#+end_src


* Development

** Ai Integration
Ollama using Ellama - Investigate how to cancel as it is quite annoying when it rambles on
#+begin_src emacs-lisp
  (use-package ellama
    :init
    (setopt ellama-keymap-prefix "C-c e")
    (require 'llm-ollama)
    :config
    (setq ellama-session-auto-save nil)
    (nj/leader-keys
      "e" '(:ignore t :wk "ellama")
      "e c" '(:ignore t :wk "code")
      "e c a" '(ellama-code-add :wk "ellama add code")
      "e c c" '(ellama-code-complete :wk "ellama code complete")
      "e c r" '(ellama-code-review :wk "ellama code review")
      "e c r" '(ellama-code-edit :wk "ellama code edit")
      "e C" '(ellama-complete :wk "ellama complete")
      "e e" '(ellama-chat :wk "ellama chat")))
#+end_src


** Languages

*** LSP
LSP Mode provides a client hook for communicating with language server protocol
#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure t
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l"
        gc-cons-threshold 100000000)
    :config
    (lsp-enable-which-key-integration t))

  ;; optionally
  ;; (use-package lsp-ui :commands lsp-ui-mode)
  ;; if you are ivy user
  (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
  (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

  ;; optionally if you want to use debugger
  (use-package dap-mode)
  ;; (use-package dap-LANGUAGE) to load the dap adapter for your language
#+end_src


*** Rust
#+begin_src emacs-lisp
  (use-package rust-mode
    :mode "\\.rs\\'")
#+end_src


*** Nix
#+begin_src emacs-lisp
  (use-package nix-mode
    :hook (nix-mode . lsp-deferred)
    :mode "\\.nix\\'")
#+end_src


*** TypeScript
#+begin_src emacs-lisp
  (use-package coverlay)

  (use-package s)
  (use-package origami)

  (use-package typescript-mode
    :hook
    (typescript-ts-mode . lsp-deferred)
    (tsx-ts-mode . lsp-deferred)
    :mode ("\\.ts\\'" . 'typescript-ts-mode)
    :mode ("\\.tsx\\'" . 'tsx-ts-mode)
    :config
    (setq typescript-indent-level 2))
  
  ;; ;; TypeScript Interactive Development Environment
  (use-package tide
    :ensure t
    :after typescript-mode company flycheck
    :hook
    (typescript-ts-mode . tide-setup)
    (tsx-ts-mode . tide-setup)
    (typescript-ts-mode . tide-hl-identifier-mode)
    (tide-mode . electric-pair-mode))

  (setq company-tooltip-align-annotations t)
#+end_src



** Project Management

*** Magit
Git management mode for emacs
#+begin_src emacs-lisp
  (use-package magit
    :config
    (nj/leader-keys
      "g" '(:ignore t :wk "git")
      "g s" '(magit-status :wk "magit status")))
#+end_src

**** Git Time Machine - Disabled
Allows for easy review of past commits
+begin_src emacs-lisp
(use-package git-timemachine
  :after magit
  :hook (evil-normalize-keymaps . git-timemachine-hook)
  :config
    (evil-define-key 'normal git-timemachine-mode-map (kbd "C-j") 'git-timemachine-show-previous-revision)
    (evil-define-key 'normal git-timemachine-mode-map (kbd "C-k") 'git-timemachine-show-next-revision)
)
+end_src


*** Projectile
Project management for emacs - could be argued core
#+begin_src emacs-lisp
  (use-package projectile
    :diminish
    :config (projectile-mode 1)
    (nj/leader-keys ;; keybinds
      "p" '(projectile-command-map :wk "projectile"))
    (setq projectile-project-search-path '("~/projects/")))
  #+end_src


** Snippets
#+begin_src 
(use-package yasnippet)
#+end_src
  
** Treemacs
Folder tree/hierarchary viewer for projects
#+begin_src emacs-lisp
  (use-package treemacs
    :defer t
    :diminish
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
    (progn
      (setq treemacs-width 28)
      (treemacs-follow-mode t)
      (treemacs-project-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-hide-gitignored-files-mode nil))
    :bind
    (:map global-map
          ("M-`"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t t"   . treemacs)
          ("C-x t d"   . treemacs-select-directory)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-evil
    :after (treemacs evil))

  (use-package treemacs-projectile
    :after (treemacs projectile))

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once))

  (use-package treemacs-magit
    :after (treemacs magit))

  (use-package treemacs-all-the-icons
    :after (treemacs all-the-icons)
    :config (treemacs-load-theme "all-the-icons"))

  (use-package treemacs-tab-bar
    :after (treemacs)
    :config (treemacs-set-scope-type 'Tabs))
#+end_src



** Tweaks

*** Misc
#+begin_src emacs-lisp
  (electric-pair-mode 1)
#+end_src


*** Rainbow Delimiters
Applies rainbow effect to delimiters and groups to sort out nesting errors
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src


*** Rainbow Mode
Render colors as a color, i.e. #ffa500
#+begin_src emacs-lisp
  (use-package rainbow-mode
    :diminish
    :hook 
    ((org-mode prog-mode) . rainbow-mode))
#+end_src


** Vterm
Terminal emulator for emacs - requires c compilation to install so it is pre-installed via nix
#+begin_src emacs-lisp
  (defun nj/vterm-close ()
    (interactive)
      (vterm-clear)
      (evil-window-delete))

  (use-package vterm
    :config
    (add-to-list 'display-buffer-alist
  	       '("\*vterm\*"
  		 (display-buffer-in-side-window)
  		 (window-height . 0.25)
  		 (side . bottom)
  		 (slot . 0)))
    (nj/leader-keys
  "v" '(vterm :wk "open vterm"))
  (define-key vterm-mode-map (kbd "C-<escape>") 'nj/vterm-close))
#+end_src


* Org
The ever-powerful...
#+begin_src emacs-lisp
    (use-package org
      :hook (org-mode . visual-line-mode)
      :config
      (require 'org-tempo) ;; allows for quick block execution
      ;; Keybinds
      (nj/leader-keys
        "o" '(:ignore t :wk "org mode")
        ;; agenda
        "o a" '(org-agenda :wk "org agenda")
        ;; edit src
        "o e" '(org-edit-special :wk "org edit")
        "o s" '(org-edit-src-exit :wk "org exit edit")
        "o c" '(org-edit-src-abort :wk "org abort edit")
        ;; tags
        "o q" '(org-set-tags-command :wk "org add tags"))

        ;; org-todo/agenda
        (setq org-agenda-files
    	    '("~/documents/org/projects.org"))

        (setq org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
    			      (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")
  			      (sequence "WANT(w)" "|" "HAVE")))

        (setq org-tag-alist
    	    '(;; Spaces
    	      ("@home" . ?H)
    	      ("@work" . ?W)
    	      ;; Devices
    	      ("@phone" . ?P)
    	      ("@computer" . ?c)

    	      ;; Activities
    	      ("@planning" . ?p)
    	      ("@dev" . ?d)
    	      ("@errands" . ?e)
    	      ("@social" . ?s)
    	      ("@calls" . ?C)
    	      ))
        
      :custom
       (org-hide-emphasis-markers nil)
       (org-startup-indented t) ;; match indentions
       ;; org src-blocks
       (org-src-fontify-natively t)
       (org-src-tab-acts-natively t))
#+end_src

** Org-Ql
Query language for searching for org entries, makes designing custom agenda entries easier
#+begin_src 
 (use-package org-ql)
#+end_src

