homeManagerModules/emacs/config/config.org
** Auto Tangle
Adds functionality for auto-tangling Org files to source files.
Otherwise, to tangle you must run 'org-babel-tangle'.
To enable auto-tangling for a given file, set the auto_tangle header to true. 
#+begin_src emacs-lisp
  (use-package org-auto-tangle
    :defer t
    :hook (org-mode . org-auto-tangle-mode))
#+end_src


** Enabling Bullets
This package enable UTF-8 bullets to org, looks a lot nicer than default *.
#+begin_src emacs-lisp
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src


** Enabling ToC
Allows for auto-generated Table of Contents in Org Mode buffers. Add headline with :toc: flag.
#+begin_src emacs-lisp
  (use-package toc-org
    :hook (org-mode . toc-org-mode))
#+end_src


** Org Roam - Disabled
Non-heirarchical node-based note manger
Disabled

(use-package org-roam
  :config
  (setq org-roam-directory (file-truename "~/org-roam")
        find-file-visit-truename t)
  (org-roam-db-autosync-mode))




  
  
  
* Misc Modes
** PDF Support
pdf-tools must be installed via nixos
#+begin_src 
  
#+end_src

